export const brandData = [
    { name: "Canon", image: "1.png" },
    { name: "Nikon", image: "2.png" },
    { name: "Sony", image: "3.png" },
    { name: "Fujifilm", image: "4.png" },
    { name: "Olympus", image: "5.png" }
]


export const typeData = [
    { name: "Камера", informations: "[{\"Частота кадров\":\"check\"},{\"Максимальное разрешение видео\":\"slider\"},{\"Тип автофокуса\":\"radio\"}]" },
    { name: "Фотоаппарат", informations: "[{\"Тип матрицы\":\"check\"},{\"Максимальное разрешение фото\":\"slider\"},{\"Тип дисплея\":\"radio\"}]" },
    { name: "Объектив", informations: "[{\"Тип\":\"check\"},{\"Число лепестков диафрагмы\":\"slider\"},{\"Тип привода автофокуса\":\"check\"}]" },
    { name: "Штатив", informations:"[{\"Максимальная высота\":\"slider\"},{\"Минимальная высота\":\"slider\"},{\"Количество секций ног\":\"check\"}]"}
]

export const productsData = [
    {
        name: "Sony A7 IV",
        description: "Полноформатная беззеркальная камера с отличным качеством изображения.",
        price: 2500,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"10"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Фазовый"}]'
      },
      {
        name: "Canon EOS R6",
        description: "Беззеркальная камера с хорошими возможностями автофокуса и быстрой серийной съемкой.",
        price: 2400,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"12"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Гибридный"}]'
      },
      {
        name: "Nikon Z6 II",
        description: "Полноформатная беззеркальная камера с хорошим балансом между качеством и портативностью.",
        price: 2000,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"14"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Фазовый"}]'
      },
      {
        name: "Fujifilm X-T4",
        description: "Беззеркальная камера с отличной цветопередачей и возможностью записи 4K видео.",
        price: 1700,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"15"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Гибридный"}]'
      },
      {
        name: "Olympus OM-D E-M1 Mark III",
        description: "Компактная беззеркальная камера с отличной стабилизацией изображения.",
        price: 1400,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"10"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Контрастный"}]'
      },
      {
        name: "Panasonic Lumix GH5",
        description: "Беззеркальная камера с отличными возможностями для видеосъемки.",
        price: 1300,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"60"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Гибридный"}]'
      },
      {
        name: "GoPro HERO11 Black",
        description: "Экшен-камера с высокой частотой кадров и прочным корпусом.",
        price: 400,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"120"},{"Максимальное разрешение видео":"5320"},{"Тип автофокуса":"Фазовый"}]'
      },
      {
        name: "DJI Osmo Action 4",
        description: "Экшен-камера с отличной стабилизацией и качественной записью видео.",
        price: 350,
        typeName: "Камера",
        imagesPath:['1.jpg','2.jpg','3.jpg','4.jpg'],
        information: '[{"Частота кадров":"60"},{"Максимальное разрешение видео":"3840"},{"Тип автофокуса":"Контрастный"}]'
      }
    
]